import {Verb, AspectualType} from './types';

const Data: Verb[] = [
  {
    id: 1,
    infinitive: 'говорить',
    type: AspectualType.IMPERFECTIVE,
    definition: 'To speak',
    aspectualPair: 2,
    conjugation: {
      present: {
        я: 'говорю',
        ты: 'говорю',
        вы: 'говорю',
        она: 'говорю',
        он: 'говорю',
        оно: 'говорю',
        мы: 'говорю',
        они: 'говорю',
      },
      past: {
        я: 'говорю',
        ты: 'говорю',
        вы: 'говорю',
        она: 'говорю',
        он: 'говорю',
        оно: 'говорю',
        мы: 'говорю',
        они: 'говорю',
      },
      future: {
        я: 'говорю',
        ты: 'говорю',
        вы: 'говорю',
        она: 'говорю',
        он: 'говорю',
        оно: 'говорю',
        мы: 'говорю',
        они: 'говорю',
      }
    }
  },
  {
    id: 2,
    infinitive: 'поговорить',
    type: AspectualType.PERFECTIVE,
    definition: 'To speak',
    aspectualPair: 2,
    conjugation: {
      present: {
        я: 'говорю',
        ты: 'говорю',
        вы: 'говорю',
        она: 'говорю',
        он: 'говорю',
        оно: 'говорю',
        мы: 'говорю',
        они: 'говорю',
      },
      past: {
        я: 'говорю',
        ты: 'говорю',
        вы: 'говорю',
        она: 'говорю',
        он: 'говорю',
        оно: 'говорю',
        мы: 'говорю',
        они: 'говорю',
      },
      future: {
        я: 'говорю',
        ты: 'говорю',
        вы: 'говорю',
        она: 'говорю',
        он: 'говорю',
        оно: 'говорю',
        мы: 'говорю',
        они: 'говорю',
      }
    }
  }
];

export default Data;